# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
tap "homebrew/core"
tap "homebrew/services"

tap "hashicorp/tap"
tap "microsoft/git"
tap "romkatv/powerlevel10k"

#tap "carlocab/personal"
#tap "sass/sass"
#tap "shivammathur/php"
#tap "weaveworks/tap"

# set arguments for all 'brew install --cask' commands
#cask_args appdir: "~/Applications" #, require_sha: true


brew 'bash' # Latest Bash version
brew 'bash-completion@2'
brew 'bat' # cat alternative
brew 'coreutils' # Those that come with macOS are outdated
brew 'moreutils' # some useful utilities like 'sponge'
brew 'findutils' # GNU 'find', 'locate', 'updatedb', and x'args', 'g'-prefixed.

brew "glib"
brew "cask"
brew "ccat"
brew "curl"
brew "libarchive"
brew "fzf"
brew "python@3.11"
brew "git"
brew 'gh'
brew 'grep'
brew "gnu-sed"
brew "htop"
brew "mackup"
brew "mas" # Mac App Store manager
brew "p7zip"
brew "telnet"
brew "tldr"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "wtfutil"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-meslo-for-powerline'
#cask 'fort-meslo-lg-nerd-font'

# Drivers
cask 'logi-options-plus'

# Important Tools
cask "monitorcontrol"
cask 'nozbe'
cask 'rectangle'
cask 'iterm2'
cask 'commander-one'
cask 'deepl'
cask 'discord' 
cask '1password'
cask '1password-cli'
cask 'notion'
cask 'raycast'
cask 'cron'
cask 'keyboard-maestro'
cask 'karabiner-elements'

# Mac App Store
#mas "AdBlock Pro", id: 1018301773
#mas "Disk Speed Test", id: 425264550
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
#mas "Kindle", id: 405399194
mas "Nozbe Personal", id: 508957583
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sync Folders", id: 530573877
mas "Tab Space", id: 1473726602
mas "1Password for Safari", id:1569813296
mas "Accelerate for Safari" id:1459809092

# Optional Tools
brew "carlocab/personal/unrar"
#brew "libass"
#brew "tesseract"
#brew "ffmpeg"
#brew "gcalcli"
#brew "glow"
#brew "lastpass-cli"
#brew "libfido2"
#brew "mplayer"
#brew "mps-youtube"
#brew "spotify-tui"
#cask "lulu"
#cask 'dropbox'
cask 'signal'
cask 'spotify'
cask 'adobe-creative-cloud'
cask 'freedom'
cask 'alfred'
#cask "lunar"
#cask "mpv"
#cask "obsidian"
#cask "qnapi"
#cask "raindropio"
#cask "via"

# Dev Tools
brew 'jq'
#brew 'ffmpeg'
#brew 'jq' # Used for spatie/visit
#brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew "sass/sass/sass"
#brew "shivammathur/php/php"
#brew "harfbuzz"
#brew "pango"
#brew "freetds"
#brew "go"
#brew "gobject-introspection"
#brew "httpd"
#brew "libpq"
#brew "mysql"
#brew "nghttp2"
#brew "ncdu"
#brew "node"
#brew "rust"
#brew "wimlib"

# DevOps Tools
#brew 'awscli'
#brew "aws-iam-authenticator"
#brew "openssl@3"
#brew "aircrack-ng"
#brew "apr-util"
#brew "argocd"
#brew "unbound"
#brew "gnutls"
#brew "emacs"
#brew "cmake"
#brew "openldap"
#brew "ctop"
#brew "librsvg"
#brew "graphviz"
#brew "helm"
#brew "hyperkit", link: false
#brew "jless"
#brew "jq"
#brew "kops"
#brew "krb5"
#brew "kubectx"
#brew "minikube"
#brew "nmap"
#brew "shellcheck"
#brew "terraform"
#brew "hashicorp/tap/consul"
#brew "hashicorp/tap/terraform-ls"
#brew "weaveworks/tap/eksctl"
#cask "git-credential-manager-core"
#cask "docker"
#cask "insomnia"
#cask "postman"
#cask "thonny"
#cask "vagrant"
#cask "virtualbox"


