# Tapstap 'azure/bicep'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'browsh-org/homebrew-browsh'
tap 'hashicorp/tap'
tap 'microsoft/git'
tap 'cfergeau/crc' # for vfkit

# set arguments for all 'brew install --cask' commands
#cask_args appdir: '~/Applications' #, require_sha: true

brew 'bash' # Latest Bash version
brew 'bash-completion@2'
brew 'bat' # cat alternative
brew 'coreutils' # Those that come with macOS are outdated
brew 'findutils' # GNU 'find', 'locate', 'updatedb', and x'args', 'g'-prefixed.
brew 'moreutils' # some useful utilities like 'sponge'

brew 'cask'
brew 'ccat'
brew 'curl'
brew 'libarchive'
brew 'fping'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'glib'
brew 'grep'
brew 'gnu-sed'
brew 'htop'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'p7zip'
brew 'telnet'
brew 'tldr'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'wtfutil'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'powerlevel10k'

# Fonts
cask 'font-go-mono-nerd-font'
cask 'font-lato'
cask 'font-meslo-for-powerline'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-3'


# GUI General Tools
cask '1password'
#cask 'alfred'
cask 'arc'
cask 'zen'
#cask 'bartender'
cask 'brave-browser'
cask 'commander-one'
cask 'cyberduck'
cask 'deepl'
cask 'firefox'
cask 'freedom'
cask 'ghostty' # Terminal emulator that uses platform-native UI and GPU acceleration
cask 'iterm2'
cask 'jordanbaird-ice' # Bartender alternative
cask 'karabiner-elements'
cask 'keyboard-maestro'
cask 'lulu'
cask 'microsoft-teams' # MS Teams
cask 'monitorcontrol'
cask 'notion-calendar'
cask 'omnidisksweeper' # disk space analyser
cask 'raycast'
cask 'rectangle'
cask 'rize' #AI time tracker
cask 'textsniper'
cask 'wezterm' #terminal with lua configuration

# CLI General Tools
cask '1password-cli'
brew 'browsh'
brew 'btop' # Resource monitor
brew 'fd' # Simple, fast and user-friendly alternative to find
brew 'glab' #GitLab CLI
brew 'gh'
brew 'imagemagick' #images transformations
brew 'lazygit' #Simple terminal UI for git commands
brew 'ripgrep' #Search tool like grep and The Silver Searcher 
brew 'mplayer' # watch videos from terminal
brew 'mpv' # watch videos from terminal
brew 'ncdu' # NCurses Disk Usage
brew 'ranger' # file manager
brew 'speedtest-cli'
brew 'tmux'
brew 'yt-dlp'
brew 'zoxide' # Shell extension to navigate your filesystem faster
#brew 'ytfzf' # watch yt videos from terminal
#brew 'lowfi' # simple CLI lofi player

# Mac App Store
mas '1Password for Safari', id:1569813296
mas 'AdGuard for Safari', id: 1440147259
mas 'Giphy Capture', id: 668208984
mas 'iA Writer', id: 775737590
mas 'Instapaper', id:288545208
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Perplexity: Ask Anything', id: 6714467650
mas 'RSA Authenticator (SecurID)', id: 318038618  
mas 'Save to Raindrop.io', id: 1549370672
mas 'Sync Folders', id: 530573877
mas 'Tab Space', id: 1473726602
mas 'Video Speed Controller', id: 1588368612
#mas 'Accelerate for Safari', id: 1459809092
#mas 'AdBlock Pro', id: 1018301773
#mas 'Disk Speed Test', id: 425264550
#mas 'Later: Save Links For Later',id: 1507396839
#mas 'Nozbe Personal', id: 508957583
#mas 'Omnivore: Read-it-later', id: 1564031042 
#mas 'Save to Pocket', id: 1477385213
#mas 'Save to Reader', id: 1640236961
#mas 'Xcode', id: 497799835

# Optional Tools
cask 'calibre' # E-books management software
cask 'dropbox'
cask 'flux-app'
cask 'telegram'
cask 'spotify'
cask 'discord' 
cask 'hazel' #test
cask 'maccy' # clipboard manager
cask 'notion'
#cask 'nozbe'
cask 'obs'
cask 'obsidian'
cask 'postman'
cask 'raindropio'
cask 'reader' # Readwise Reader
cask 'rocket'
cask 'signal'
cask 'superhuman'
cask 'visual-studio-code'
cask 'vlc'
cask 'youtube-downloader'
cask 'zed'
cask 'zoom'
brew 'blueutil'
brew 'smudge/smudge/nightlight'
cask 'send-to-kindle'
# cask 'setapp'
cask 'todoist-app'
#cask 'logseq'
#brew 'carlocab/personal/unrar'
#brew 'libass'
#brew 'tesseract'
#brew 'ffmpeg'
#brew 'gcalcli'
#brew 'glow'
#brew 'lastpass-cli'
#brew 'libfido2'
#brew 'mplayer'
#brew 'mps-youtube'
#brew 'spotify-tui'
#cask 'lunar'
#cask 'mpv'
#cask 'qnapi'
#cask 'via'
#cask 'surfshark'
#brew 'bluetoothconnector'

# Dev Tools
#cask 'anaconda'
brew 'jq'
brew 'git-filter-repo'
brew 'nvm' # node version manager
brew 'protobuf'
brew 'qemu'
brew 'rust'
#brew 'ffmpeg'
#brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'sass/sass/sass'
#brew 'shivammathur/php/php'
#brew 'harfbuzz'
#brew 'pango'
#brew 'freetds'
brew 'go'
#brew 'gobject-introspection'
#brew 'httpd'
#brew 'libpq'
#brew 'mysql'
#brew 'nghttp2'
#brew 'ncdu'
#brew 'node'
#brew 'wimlib'
#cask 'tableplus' # sql gui client

# DevOps Tools
# python
brew 'python@3.13'
brew 'pyenv'
brew 'pyenv-virtualenvwrapper'
brew 'pandoc'
# docker
brew 'colima'
brew 'docker-buildx'
brew 'docker-completion'
brew 'docker-compose'
# K8s
brew 'minikube'
brew 'k9s'
brew 'kubectx'
brew 'helm'
brew 'vfkit' #VMs
# clouds
brew 'azure-cli'
brew 'bicep'
brew 'aztfexport'
cask 'gcloud-cli'
# databases
brew 'libpq'
cask 'dbeaver-community'
# terraform
brew 'hashicorp/tap/terraform'
brew 'terraformer'
brew 'tfsec'
###
cask 'citrix-workspace'
brew 'stoken'
brew 'openvpn'
brew 'sops' #Simple And Flexible Tool For Managing Secrets
brew 'cmake'
brew 'awscli'
brew 'aws-iam-authenticator'
#brew 'openssl@3'
#brew 'aircrack-ng'
#brew 'apr-util'
#brew 'argocd'
#brew 'unbound'
#brew 'gnutls'
#brew 'emacs'
#brew 'openldap'
#brew 'ctop'
#brew 'librsvg'
#brew 'graphviz'
#brew 'helm'
#brew 'hyperkit', link: false
#brew 'jless'
#brew 'jq'
#brew 'kops'
#brew 'krb5'
#brew 'nmap'
#brew 'shellcheck'
#brew 'hashicorp/tap/consul'
#brew 'hashicorp/tap/terraform-ls'
#brew 'weaveworks/tap/eksctl'
#cask 'git-credential-manager-core'
#cask 'docker'
#cask 'insomnia'
#cask 'postman'
#cask 'thonny'
#cask 'vagrant'
#cask 'virtualbox'

#No-code tools
#cast 'airtable'

#Photo tools
cask 'calibrite-profiler'
cask 'wacom-tablet'

# Design tools
cask 'adobe-creative-cloud'
#cask 'figma'
#cask 'sketch'
cask 'ogdesign-eagle'

# 3D printing tools
cask 'bambu-studio'
#cask 'prusaslicer'
#cask 'ultimaker-cura'

# Hack/Security Tools
#cask 'burp-suite'	#proxy tool
cask 'caido'		#proxy tool

# Games
cask 'steam'
brew 'innoextract'	#tool to extract GOG Windows-based installers

# Crypto
cask 'ledger-live'

# AI Tools
brew 'aider'
cask 'claude'
cask 'claude-code'
brew 'gemini-cli'
brew 'ollama'
cask 'superwhisper'
# cask 'cursor'
# cask 'windsurf'

## THINK ABOUT THIS LATER
brew 'docker'
brew 'gdbm'
brew 'libtommath'
brew 'libvterm'
brew 'luv'
brew 'unibilium'
brew 'pybind11'
brew 'python@3.11'
#brew 'pytorch'
brew 'zlib'
brew 'eigen'                 
brew 'libomp'                
brew 'libuv'                 
brew 'lpeg'                  
brew 'msgpack'               
brew 'neovim'                
brew 'python@3.10'           
brew 'sleef'                 
brew 'tcl-tk'
#cask 'microsoft-auto-update'
