# VS Code extensions
# Install with: cat vscode-extensions.txt | grep -v '^#' | xargs -L1 code --install-extension

# AI & Claude
anthropic.claude-code
github.copilot
github.copilot-chat
iganbold.superdesign

# Azure & Cloud
ms-azuretools.azure-dev
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurecontainerapps
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-azureterraform
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-bicep
ms-azuretools.vscode-containers
ms-azuretools.vscode-cosmosdb
ms-azure-devops.azure-pipelines
ms-azure-load-testing.microsoft-testing
ms-vscode.azure-account
ms-vscode.azure-repos
ms-vscode.vscode-node-azure-pack
ms-vscode.remote-repositories

# Terraform
hashicorp.terraform
pjmiravalle.terraform-advanced-syntax-highlighting

# Python & Jupyter
ms-python.python
ms-python.debugpy
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Docker
docker.docker

# Git
eamodio.gitlens
github.remotehub
github.github-vscode-theme

# Markdown & Docs
yzhang.markdown-all-in-one
yzane.markdown-pdf
bierner.markdown-emoji
tomoki1207.pdf
vsls-contrib.codetour

# Themes
dracula-theme.theme-dracula
endormi.2077-theme
teabyii.ayu
uloco.theme-bluloco-light
zhuangtongfa.material-theme

# Productivity
esbenp.prettier-vscode
mcright.auto-save
mechatroner.rainbow-csv
mermaidchart.vscode-mermaid-chart
adriandoescoding.http
patbenatar.advanced-new-file
sleistner.vscode-fileutils
sergeyegorov.folder-color
visbydev.folder-path-color

# GFT (internal – may not be available on marketplace)
# gft-technologies-se.gft-ai-impact-assist
# gftaiimpactdocumentation.vscode-create-document-extension

# Other
cweijan.vscode-office
ms-dotnettools.vscode-dotnet-runtime
ms-windows-ai-studio.windows-ai-studio
teamsdevapp.vscode-ai-foundry
